In [19]:
import pandas as pd
import string

In [24]:
from nltk.corpus import stopwords 
from nltk.tokenize import word_tokenize
from nltk.stem import WordNetLemmatizer

In [2]:
#load the data from the other directory
df=pd.read_csv('../raw_data/Train_rev1_3k.csv')

In [3]:
#drop null rows
df=df.dropna(axis=0, how='all')
df

,Id,Title,FullDescription,LocationRaw,LocationNormalized,ContractType,ContractTime,Company,Category,SalaryRaw,SalaryNormalized,SourceName
0,12612628.0,Engineering Systems Analyst,Engineering Systems Analyst Dorking Surrey Sal...,"Dorking, Surrey, Surrey",Dorking,NaN,permanent,Gregory Martin International,Engineering Jobs,20000 - 30000/annum 20-30K,25000.0,cv-library.co.uk
1,12612830.0,Stress Engineer Glasgow,Stress Engineer Glasgow Salary **** to **** We...,"Glasgow, Scotland, Scotland",Glasgow,NaN,permanent,Gregory Martin International,Engineering Jobs,25000 - 35000/annum 25-35K,30000.0,cv-library.co.uk
2,12612844.0,Modelling and simulation analyst,Mathematical Modeller / Simulation Analyst / O...,"Hampshire, South East, South East",Hampshire,NaN,permanent,Gregory Martin International,Engineering Jobs,20000 - 40000/annum 20-40K,30000.0,cv-library.co.uk
3,12613049.0,Engineering Systems Analyst / Mathematical Mod...,Engineering Systems Analyst / Mathematical Mod...,"Surrey, South East, South East",Surrey,NaN,permanent,Gregory Martin International,Engineering Jobs,25000 - 30000/annum 25K-30K negotiable,27500.0,cv-library.co.uk
4,12613647.0,"Pioneer, Miser Engineering Systems Analyst","Pioneer, Miser Engineering Systems Analyst Do...","Surrey, South East, South East",Surrey,NaN,permanent,Gregory Martin International,Engineering Jobs,20000 - 30000/annum 20-30K,25000.0,cv-library.co.uk
...,...,...,...,...,...,...,...,...,...,...,...,...
2995,56365710.0,SEN Teaching Assistant,Secondary school teacher required for a Specia...,Kent,Kent,full_time,contract,Teaching Appointments,Teaching Jobs,From 7 to 9 per hour,15360.0,jobsineducation.co.uk
2996,56365777.0,Teaching Investor (Maternity Cover),LOCATION: Aylesbury JOB TITLE: Teaching Invest...,Buckinghamshire,Buckinghamshire,full_time,permanent,JOBG8,Teaching Jobs,"Up to 17,717 per year + 16393.00-17717.00",17717.0,jobsineducation.co.uk
2997,56365883.0,Level 3 Teaching Assistant needed in Tamworth,Level 3 Teaching Assistant needed to work in T...,Staffordshire,Staffordshire,full_time,contract,ABC Teachers,Teaching Jobs,From 40 to 70 per day,13200.0,jobsineducation.co.uk
2998,56365913.0,Teachers with QTS call A Teachers,Do you have QTS? Are you motivated to really m...,Hertfordshire,Hertfordshire,full_time,permanent,A Plus Teachers,Teaching Jobs,From 100 to 140 per day + Daily rate negotiable,28800.0,jobsineducation.co.uk
2999,56365917.0,Art HOD,A Teachers is looking to recruit an Art HOD Te...,London,London,full_time,permanent,A Plus Teachers,Teaching Jobs,"From 25,000 to 45,000 per year + School Teache...",35000.0,jobsineducation.co.uk

In [4]:
#drop unusefull info
df=df.drop(columns=['Id',
                    'LocationRaw',
                    'LocationNormalized',
                    'ContractType',
                    'ContractTime',
                    'Company',
                    'SalaryRaw',
                    'SourceName'])
df

,Title,FullDescription,Category,SalaryNormalized
0,Engineering Systems Analyst,Engineering Systems Analyst Dorking Surrey Sal...,Engineering Jobs,25000.0
1,Stress Engineer Glasgow,Stress Engineer Glasgow Salary **** to **** We...,Engineering Jobs,30000.0
2,Modelling and simulation analyst,Mathematical Modeller / Simulation Analyst / O...,Engineering Jobs,30000.0
3,Engineering Systems Analyst / Mathematical Mod...,Engineering Systems Analyst / Mathematical Mod...,Engineering Jobs,27500.0
4,"Pioneer, Miser Engineering Systems Analyst","Pioneer, Miser Engineering Systems Analyst Do...",Engineering Jobs,25000.0
...,...,...,...,...
2995,SEN Teaching Assistant,Secondary school teacher required for a Specia...,Teaching Jobs,15360.0
2996,Teaching Investor (Maternity Cover),LOCATION: Aylesbury JOB TITLE: Teaching Invest...,Teaching Jobs,17717.0
2997,Level 3 Teaching Assistant needed in Tamworth,Level 3 Teaching Assistant needed to work in T...,Teaching Jobs,13200.0
2998,Teachers with QTS call A Teachers,Do you have QTS? Are you motivated to really m...,Teaching Jobs,28800.0
2999,Art HOD,A Teachers is looking to recruit an Art HOD Te...,Teaching Jobs,35000.0

In [5]:
#change all text to lower case function
def lower_case(column):
    column=column.str.lower()
    return column

In [6]:
#
df['Title']=lower_case(df['Title'])
df['FullDescription']=lower_case(df['FullDescription'])
df['Category']=lower_case(df['Category'])
df

,Title,FullDescription,Category,SalaryNormalized
0,engineering systems analyst,engineering systems analyst dorking surrey sal...,engineering jobs,25000.0
1,stress engineer glasgow,stress engineer glasgow salary **** to **** we...,engineering jobs,30000.0
2,modelling and simulation analyst,mathematical modeller / simulation analyst / o...,engineering jobs,30000.0
3,engineering systems analyst / mathematical mod...,engineering systems analyst / mathematical mod...,engineering jobs,27500.0
4,"pioneer, miser engineering systems analyst","pioneer, miser engineering systems analyst do...",engineering jobs,25000.0
...,...,...,...,...
2995,sen teaching assistant,secondary school teacher required for a specia...,teaching jobs,15360.0
2996,teaching investor (maternity cover),location: aylesbury job title: teaching invest...,teaching jobs,17717.0
2997,level 3 teaching assistant needed in tamworth,level 3 teaching assistant needed to work in t...,teaching jobs,13200.0
2998,teachers with qts call a teachers,do you have qts? are you motivated to really m...,teaching jobs,28800.0
2999,art hod,a teachers is looking to recruit an art hod te...,teaching jobs,35000.0

In [7]:
string.punctuation

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'

In [10]:
def revmove_punctuation(column):
    for i in range(len(column)):
        for punctuation in string.punctuation:
            column[i] = str(column[i]).replace(punctuation, '')
    return column

In [11]:
df['Title']=revmove_punctuation(df['Title'])

/tmp/ipykernel_30838/2003543172.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i] = str(column[i]).replace(punctuation, '')

In [12]:
df['FullDescription	']=revmove_punctuation(df['FullDescription'])

/tmp/ipykernel_30838/2003543172.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i] = str(column[i]).replace(punctuation, '')

In [13]:
df

,Title,FullDescription,Category,SalaryNormalized,FullDescription\t
0,engineering systems analyst,engineering systems analyst dorking surrey sal...,engineering jobs,25000.0,engineering systems analyst dorking surrey sal...
1,stress engineer glasgow,stress engineer glasgow salary to we re curr...,engineering jobs,30000.0,stress engineer glasgow salary to we re curr...
2,modelling and simulation analyst,mathematical modeller simulation analyst ope...,engineering jobs,30000.0,mathematical modeller simulation analyst ope...
3,engineering systems analyst mathematical mode...,engineering systems analyst mathematical mode...,engineering jobs,27500.0,engineering systems analyst mathematical mode...
4,pioneer miser engineering systems analyst,pioneer miser engineering systems analyst dor...,engineering jobs,25000.0,pioneer miser engineering systems analyst dor...
...,...,...,...,...,...
2995,sen teaching assistant,secondary school teacher required for a specia...,teaching jobs,15360.0,secondary school teacher required for a specia...
2996,teaching investor maternity cover,location aylesbury job title teaching investor...,teaching jobs,17717.0,location aylesbury job title teaching investor...
2997,level 3 teaching assistant needed in tamworth,level 3 teaching assistant needed to work in t...,teaching jobs,13200.0,level 3 teaching assistant needed to work in t...
2998,teachers with qts call a teachers,do you have qts are you motivated to really ma...,teaching jobs,28800.0,do you have qts are you motivated to really ma...
2999,art hod,a teachers is looking to recruit an art hod te...,teaching jobs,35000.0,a teachers is looking to recruit an art hod te...

In [14]:
#remove numbers
def remove_number(column):
    for i in range(len(column)):
        column[i]=''.join(word for word in column[i] if not word.isdigit())
    return column

In [15]:
df['FullDescription']=remove_number(df['FullDescription'])
df

/tmp/ipykernel_30838/1476202758.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i]=''.join(word for word in column[i] if not word.isdigit())

,Title,FullDescription,Category,SalaryNormalized,FullDescription\t
0,engineering systems analyst,engineering systems analyst dorking surrey sal...,engineering jobs,25000.0,engineering systems analyst dorking surrey sal...
1,stress engineer glasgow,stress engineer glasgow salary to we re curr...,engineering jobs,30000.0,stress engineer glasgow salary to we re curr...
2,modelling and simulation analyst,mathematical modeller simulation analyst ope...,engineering jobs,30000.0,mathematical modeller simulation analyst ope...
3,engineering systems analyst mathematical mode...,engineering systems analyst mathematical mode...,engineering jobs,27500.0,engineering systems analyst mathematical mode...
4,pioneer miser engineering systems analyst,pioneer miser engineering systems analyst dor...,engineering jobs,25000.0,pioneer miser engineering systems analyst dor...
...,...,...,...,...,...
2995,sen teaching assistant,secondary school teacher required for a specia...,teaching jobs,15360.0,secondary school teacher required for a specia...
2996,teaching investor maternity cover,location aylesbury job title teaching investor...,teaching jobs,17717.0,location aylesbury job title teaching investor...
2997,level 3 teaching assistant needed in tamworth,level teaching assistant needed to work in ta...,teaching jobs,13200.0,level 3 teaching assistant needed to work in t...
2998,teachers with qts call a teachers,do you have qts are you motivated to really ma...,teaching jobs,28800.0,do you have qts are you motivated to really ma...
2999,art hod,a teachers is looking to recruit an art hod te...,teaching jobs,35000.0,a teachers is looking to recruit an art hod te...

In [20]:
#remove stop words
def remove_stopwords(column):

    stop_words = set(stopwords.words('english'))
    
    for i in range(len(column)):
        temp=word_tokenize(column[i])
        column[i]=[w for w in temp if not w in stop_words]
    return column

In [25]:
df['FullDescription']=remove_stopwords(df['FullDescription'])
df

/tmp/ipykernel_30838/3261850546.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i]=[w for w in temp if not w in stop_words]

,Title,FullDescription,Category,SalaryNormalized,FullDescription\t
0,engineering systems analyst,"[engineering, systems, analyst, dorking, surre...",engineering jobs,25000.0,engineering systems analyst dorking surrey sal...
1,stress engineer glasgow,"[stress, engineer, glasgow, salary, currently,...",engineering jobs,30000.0,stress engineer glasgow salary to we re curr...
2,modelling and simulation analyst,"[mathematical, modeller, simulation, analyst, ...",engineering jobs,30000.0,mathematical modeller simulation analyst ope...
3,engineering systems analyst mathematical mode...,"[engineering, systems, analyst, mathematical, ...",engineering jobs,27500.0,engineering systems analyst mathematical mode...
4,pioneer miser engineering systems analyst,"[pioneer, miser, engineering, systems, analyst...",engineering jobs,25000.0,pioneer miser engineering systems analyst dor...
...,...,...,...,...,...
2995,sen teaching assistant,"[secondary, school, teacher, required, special...",teaching jobs,15360.0,secondary school teacher required for a specia...
2996,teaching investor maternity cover,"[location, aylesbury, job, title, teaching, in...",teaching jobs,17717.0,location aylesbury job title teaching investor...
2997,level 3 teaching assistant needed in tamworth,"[level, teaching, assistant, needed, work, tam...",teaching jobs,13200.0,level 3 teaching assistant needed to work in t...
2998,teachers with qts call a teachers,"[qts, motivated, really, make, difference, pup...",teaching jobs,28800.0,do you have qts are you motivated to really ma...
2999,art hod,"[teachers, looking, recruit, art, hod, teacher...",teaching jobs,35000.0,a teachers is looking to recruit an art hod te...

In [26]:
#lemmatize

def lemmatize(column):
    for i in range(len(column)):
        lemmatizer = WordNetLemmatizer()

        column[i] = [lemmatizer.lemmatize(word) for word in column[i]]
        column[i] =' '.join(column[i]) #把所有的单词join成一个string
    return column

In [27]:
df['FullDescription']=lemmatize(df['FullDescription'])
df

/tmp/ipykernel_30838/4209796426.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i] = [lemmatizer.lemmatize(word) for word in column[i]]
/tmp/ipykernel_30838/4209796426.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  column[i] =' '.join(column[i]) #把所有的单词join成一个string

,Title,FullDescription,Category,SalaryNormalized,FullDescription\t
0,engineering systems analyst,engineering system analyst dorking surrey sala...,engineering jobs,25000.0,engineering systems analyst dorking surrey sal...
1,stress engineer glasgow,stress engineer glasgow salary currently looki...,engineering jobs,30000.0,stress engineer glasgow salary to we re curr...
2,modelling and simulation analyst,mathematical modeller simulation analyst opera...,engineering jobs,30000.0,mathematical modeller simulation analyst ope...
3,engineering systems analyst mathematical mode...,engineering system analyst mathematical modell...,engineering jobs,27500.0,engineering systems analyst mathematical mode...
4,pioneer miser engineering systems analyst,pioneer miser engineering system analyst dorki...,engineering jobs,25000.0,pioneer miser engineering systems analyst dor...
...,...,...,...,...,...
2995,sen teaching assistant,secondary school teacher required special scho...,teaching jobs,15360.0,secondary school teacher required for a specia...
2996,teaching investor maternity cover,location aylesbury job title teaching investor...,teaching jobs,17717.0,location aylesbury job title teaching investor...
2997,level 3 teaching assistant needed in tamworth,level teaching assistant needed work tamworth ...,teaching jobs,13200.0,level 3 teaching assistant needed to work in t...
2998,teachers with qts call a teachers,qts motivated really make difference pupil edu...,teaching jobs,28800.0,do you have qts are you motivated to really ma...
2999,art hod,teacher looking recruit art hod teacher london...,teaching jobs,35000.0,a teachers is looking to recruit an art hod te...

In [28]:
df['FullDescription']

0       engineering system analyst dorking surrey sala...
1       stress engineer glasgow salary currently looki...
2       mathematical modeller simulation analyst opera...
3       engineering system analyst mathematical modell...
4       pioneer miser engineering system analyst dorki...
                              ...
2995    secondary school teacher required special scho...
2996    location aylesbury job title teaching investor...
2997    level teaching assistant needed work tamworth ...
2998    qts motivated really make difference pupil edu...
2999    teacher looking recruit art hod teacher london...
Name: FullDescription, Length: 3000, dtype: object

In [49]:
df['Category'].value_counts()

healthcare & nursing jobs           2095
it jobs                              255
hospitality & catering jobs          175
engineering jobs                     144
accounting & finance jobs             60
sales jobs                            50
other/general jobs                    41
hr & recruitment jobs                 33
scientific & qa jobs                  29
travel jobs                           28
customer services jobs                21
trade & construction jobs             15
teaching jobs                         10
manufacturing jobs                     8
retail jobs                            7
consultancy jobs                       7
property jobs                          4
energy, oil & gas jobs                 4
admin jobs                             3
creative & design jobs                 2
logistics & warehouse jobs             2
pr, advertising & marketing jobs       2
charity & voluntary jobs               2
legal jobs                             1
maintenance jobs                       1
domestic help & cleaning jobs          1
Name: Category, dtype: int64

In [50]:
#from sklearn.feature_extraction.text import CountVectorizer

#vectorizer = CountVectorizer()

#X_vec = vectorizer.fit_transform(df['FullDescription'])

In [58]:
from sklearn.feature_extraction.text import TfidfVectorizer

vectorizer = TfidfVectorizer()
X_vec= vectorizer.fit_transform(df['FullDescription'])

In [60]:
X_vec.shape

(3000, 11648)

In [51]:
X_vec

<3000x11648 sparse matrix of type '<class 'numpy.int64'>'
	with 288101 stored elements in Compressed Sparse Row format>

In [52]:
from sklearn.naive_bayes import MultinomialNB
from sklearn.model_selection import cross_validate

cv_nb = cross_validate( MultinomialNB(), X_vec, df['Category'], scoring = "accuracy")

cv_nb['test_score'].mean()

/home/yan/.pyenv/versions/3.8.12/envs/hooked-on-recruiting/lib/python3.8/site-packages/sklearn/model_selection/_split.py:676: UserWarning: The least populated class in y has only 1 members, which is less than n_splits=5.
  warnings.warn(

0.8876666666666667